{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hey",
          "How are you",
          "Is anyone there?",
          "Hello",
          "Good day"
        ],
        "responses": [
          "Hey :-)",
          "Hello, thanks for visiting",
          "Hi there, what can I do for you?",
          "Hi there, how can I help?"
        ]
      },
      {
        "tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye"],
        "responses": [
          "See you later, thanks for visiting",
          "Have a nice day",
          "Bye! Come back again soon."
        ]
      },
      {
        "tag": "thanks",
        "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
        "responses": ["Happy to help!", "Any time!", "My pleasure"]
      },
      {
        "tag": "approvalprocess",
        "patterns": ["Where I can find the information related to Approval Process 2020-21","find the information","Approval Process 2020-21"],
        "responses": ["Information related to Approval Process 2020-21 available on AICTE Website's Homepage>Quick Links>Approval Process 2020-21"]
      },
      {
        "tag": "newuserid",
        "patterns": ["How can I get New User-id and password (login credentials) for AICTE Web Portal","New User-id and password"," get New User-id","login credentials) for AICTE Web Portal"],
        "responses": ["Please click on Sign Up link on AICTE Web-portal or go to link http://portal.aicteindia.org/partnerportal_enu. User Manual for Obtaining USERNAME and PASSWORD @ https://aicte-india.org/bureaus/approval/ap_2020-21"]
      },
      {
        "tag": "forgottenpassword",
        "patterns": [" I have forgotten password for logging in AICTE Web Portal. What is the procedure to recover this","forgotten password"],
        "responses": [" Please refer User Manual for Forgotten Password available @ https://aicteindia.org/bureaus/approval/ap_2020-21"]
      },
      {
        "tag": "fieldvalidation",
        "patterns": [" Is User Id field mandatory for 'Forgot Password' form","User Id field mandatory"],
        "responses": [" No, User Id is NOT mandatory. Only Permanent Institute Id is required for existing institute. In case of new institute (received Letter of Approval(LOA) in previous year) can enter Current Application Id. "]
      },
      {
        "tag": "invalidusernameandpassword",
        "patterns": [" When I try to login with Institute's Credentials, error message 'Invalid Username and Password' is displayed. What should I do","error message","'Invalid Username and Password'"],
        "responses": ["Recheck the login credentials. Confirm whether someone else has logged in with the same credentials (Please note that per institute only ONE session is allowed. Hence, if someone tries  for 2nd session then again invalid user name and password message will popup). If no session is live and still getting an invalid username and password message, then the password might be incorrect. In such cases, you can 'Request for forgot password'."]
      },
      
      {
        "tag": "approvalprocessapply",
        "patterns": [" How can I apply for Approval Process 2020-21 for our institute","apply for Approval Process"],
        "responses": ["Please login to AICTE Webportal using your institutes login credentials then click on Approval Process icon. Follow the instructions given in User Manuals/Videos and apply accordingly. For more information, please go through Approval Process Handbook 2020-21."]
      },
      
      {
        "tag": "reportgenerate",
        "patterns": [" I am not able to generate report","not able to generate"],
        "responses": ["Please refer “User Manual for Report Generation” to generate Reports. "]
      },
      {
        "tag": "deletefaculty",
        "patterns": [" How to delete old faculty details","delete old faculty details"],
        "responses": [" Faculty record cannot be deleted. Faculty can be marked as “Duplicate” or “Left the Institute” under HOI & Faculty Details tab. "]
      },
      {
        "tag": "aadhaar/panmandation",
        "patterns": [" Is Aadhaar/PAN details mandatory to update faculty details in AICTE Web Portal","Aadhaar/PAN details mandatory"],
        "responses": [" Yes "]
      },
      {
        "tag": "transferrecord",
        "patterns": ["How to transfer faculty record(individual) from one institute to another institute","transfer faculty record"],
        "responses": ["This facility is available under HOI & Faculty tab. Before transferring any individual faculty record from one institute to other institute, the faculty should be compulsorily marked as “left the institute” in the previous institute. "]
      },
      {
        "tag": "addfaculity",
        "patterns": ["How to update/add the faculty details by import method","update/add the faculty details","import method"],
        "responses": [" Please follow the User Manual available @ https://aicte-india.org/bureaus/approval/ap_2020-21 for uploading faculty details by import method. "]
      },
      {
        "tag": "paymentupdate",
        "patterns": ["I have made Online Payment but amount is not updated in portal.","Online Payment but amount is not updated"],
        "responses": ["Generally, payment receipt gets updated immediately. In case, your payment receipt is not updated then click on View Transaction Button under Payment tab. Otherwise, it will get updated in 48 to 72 working hours (2 to 3 working days). In case it is not updated even after that, please raise grievance with transaction details (Transaction Id generated while making the payment) through Online Grievance Redressal form. Link is available on Approval Process 2020-21 page."]
      },
      {
        "tag": "paymentgatewayprob",
        "patterns": ["I am not able to make payment because AICTE Website is not directing to Payment Gateway.","not able to make payment","not directing to Payment Gateway"],
        "responses": ["Please check whether your application has been submitted successfully or not. If submitted, then allow Popups for AICTE Website through Web browser URL."]
      },
      {
        "tag": "paymentqueries",
        "patterns": [" Where to send the queries related to portal, payment and approval related issues for the Academic Year 2020-21","send the queries related to portal","payment and approval related issues"],
        "responses": ["Raise a Grievance via grievance form available at https://www.facilities.aicteindia.org/Approval Process/apformEmail.php."]
      },
      {
        "tag": "sameuseriduse",
        "patterns": ["Our Institution was allotted a User ID last year as a new Institution. Some information was uploaded but the application could not be submitted at that time. Now I want to know that the same User ID can be used for approval process 2020-21.","User ID can be used for approval process"],
        "responses": ["No, Institute need to apply afresh for getting login credentials. "]
      },
      {
        "tag": "changedetails",
        "patterns": [" We want to change details which are non-editable / read-only","change details which are non-editable"],
        "responses": ["You may contact the Approval Bureau or Regional Office. "]
      },
      {
        "tag": "reopenapplication",
        "patterns": ["By mistake, I have submitted my application. Is it possible to reopen the application once again to update the few details"," reopen the application once again to update"],
        "responses": ["If you have not created any payment record under Payment tab then you can re-open the submitted application only once by clicking on “re-open application” button available under Attachments and Submit tab.\nNote: After re-open, the application should be resubmitted. Otherwise application will be treated as “Application Not Submitted”. "]
      },
      {
        "tag": "passwordnotreceived",
        "patterns": ["I have applied for forgot password but still I did not receive password on my registered email","forgot password but still I did not receive password"],
        "responses": ["Institute need to submit the Affidavit-1 in the respective Regional Office. Regional Officer will flag the Affidavit Received against your request on web portal. Then password will be sent to the institutes registered email id. Please check the Spam Folder also in your mailbox for forgot password email. In case of any issue, you may raise your grievance online by Grievance link available @ https://aicte-india.org/bureaus/approval/ap_2020-2 "]
      }
    ]
  }